In [1]:
import pandas as pd

In [4]:
# Read the CSV file
df = pd.read_csv('./EmployeeSQL/employees.csv')

In [5]:
df.head()

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001   7/25/1953    Hideyuki   Zallocco   M   4/28/1990
1  475053        e0002  11/18/1954       Byong  Delgrande   F    9/7/1991
2   57444        e0002   1/30/1958       Berry       Babb   F   3/21/1992
3  421786        s0001   9/28/1957       Xiong   Verhoeff   M  11/26/1987
4  282238        e0003  10/28/1952  Abdelkader    Baumann   F   1/18/1991

In [6]:
# Convert date columns to datetime format
df['hire_date'] = pd.to_datetime(df['hire_date'], format='%m/%d/%Y')
df['birth_date'] = pd.to_datetime(df['birth_date'], format='%m/%d/%Y')

# Convert date format to yyyy/mm/dd
df['hire_date'] = df['hire_date'].dt.strftime('%Y/%m/%d')
df['birth_date'] = df['birth_date'].dt.strftime('%Y/%m/%d')

In [9]:
df.head()

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001  1953/07/25    Hideyuki   Zallocco   M  1990/04/28
1  475053        e0002  1954/11/18       Byong  Delgrande   F  1991/09/07
2   57444        e0002  1958/01/30       Berry       Babb   F  1992/03/21
3  421786        s0001  1957/09/28       Xiong   Verhoeff   M  1987/11/26
4  282238        e0003  1952/10/28  Abdelkader    Baumann   F  1991/01/18

In [12]:
# Save the modified data to a new CSV file
df.to_csv('./EmployeeSQL/employees_new.csv', index=False)